data = [
    {
        'movie': 'Карты, деньги, два ствола',
        'year': 1998,
        'director': 'Гай Ричи',
        'starring': [
            'Джейсон Флеминг',
            'Декстер Флетчер',
            'Ник Моран',
            'Джейсон Стэйтем',
            'Стивен Макинтош',
            'Николас Роу',
            'Ник Марк',
            'Чарльз Форбс',
            'Винни Джонс',
            'Ленни МакЛин',
        ]
    },
    {
        'movie': 'Ограбление по-итальянски',
        'year': 2003,
        'director': 'Ф. Гэри Грей',
        'starring': [
            'Шарлиз Терон',
            'Марк Уолберг',
            'Дональд Сазерленд',
            'Джейсон Стэйтем',
            'Сет Грин',
            'Ясин Бей',
            'Эдвард Нортон',
            'Фаусто Каллегарини',
            'Стефано Петронелли',
            'Фабио Скарпа',
        ]
    }
]
